<script setup>
	import { inject, ref } from "vue";
	import { data } from "../utils/data";
	const text =
		"Здесь должен быть текст политики конфиденциальности, шаблон можно найти в интернете и адаптировать для своего сайта, например попросив нейронку.";
	const height = inject("headerHeight");
   const versionDate = ref('27.05.2025г.')
</script>
<template>
	<div
		class="page"
		:style="{
			height: `calc(100vh - ${height}px)`,
			marginTop: `${height}px`,
			overflowY: 'auto',
			padding: '2em 0',
		}">
		<div class="container">
         <div class="page-row fs-7">
            Версия политики конфиденциальности: <strong>{{ versionDate }}</strong>
         </div>
			<div class="content">
				<h1 class="fs-md">📄 Политика конфиденциальности</h1>
				<div class="content-head fs-5">
					<p>
						Настоящая Политика конфиденциальности определяет порядок сбора, хранения,
						обработки и защиты персональной информации, предоставляемой пользователями
						при использовании образовательной платформы
						<strong> Правильный курс. </strong>
						Мы уважаем ваше право на конфиденциальность и стремимся обеспечить
						максимальную защиту ваших персональных данных. Настоящая Политика
						разработана в соответствии с
						<a href="#" class="base-color"
							>Федеральным законом Российской Федерации от 27.07.2006 № 152-ФЗ «О
							персональных данных».</a
						>.
					</p>
					<ol>
						<li>
							Сбор и использование персональных данных При регистрации на нашем сайте
							мы собираем следующие данные: Имя Email-адрес Пароль (в зашифрованном
							виде) Данные о пройденных курсах, прогресс обучения IP-адрес и информация
							о браузере (для обеспечения безопасности и аналитики) Эти данные
							используются для следующих целей: Предоставления доступа к курсам
							Обеспечения связи с пользователем (поддержка, рассылка) Учета активности
							и прогресса обучения Обеспечения безопасности аккаунта
						</li>
						<li>
							Не собираемые и не хранимые данные Банковские реквизиты не передаются нам
							напрямую , так как оплата курсов осуществляется через сторонние сервисы
							(например, платёжные системы). Мы не храним и не обрабатываем банковскую
							информацию . Вся информация о платежах регулируется политикой
							соответствующего платёжного провайдера.
						</li>
                  <li>  
                     Получение согласия Согласие на обработку персональных данных
					предоставляется пользователем добровольно при регистрации на сайте.
					Продолжая регистрацию, вы подтверждаете, что ознакомлены с данной политикой
					и даёте согласие на обработку своих персональных данных. Вы можете отозвать
					согласие в любой момент, отправив запрос по адресу: 📧 [укажите email для
					обращений]
                  </li>
                  <li>
                     Хранение и защита данных Для обеспечения безопасности
					персональных данных принимаются следующие меры: Шифрование паролей с
					использованием современных алгоритмов Передача данных только по защищённому
					протоколу HTTPS Ограничение доступа к данным внутри нашей команды Ведение
					логов изменений (при необходимости) Защита от несанкционированного доступа
					через систему аутентификации Персональные данные хранятся только до тех
					пор, пока вы используете нашу платформу, либо до тех пор, пока это
					необходимо для достижения цели их обработки. Вы можете запросить удаление
					аккаунта и всех связанных данных.
                  </li>
                  <li>
                     Передача данных третьим лицам Мы можем
					передавать ваши данные следующим категориям лиц: Платёжным системам (только
					для совершения транзакций) Сервисам email-рассылок (для информирования о
					новых курсах и изменениях) Аналитическим системам (Google Analytics /
					Яндекс.Метрика) — при наличии согласия Третьи лица могут находиться вне
					территории РФ, поэтому мы информируем вас о возможности трансграничной
					передачи персональных данных.
                  </li>
                  <li>
                     Изменения в политике Мы оставляем за собой
					право вносить изменения в настоящую политику конфиденциальности. Все
					изменения публикуются на этой странице с указанием даты последнего
					обновления.
                  </li>
                  <li>
                     Контакты Если у вас есть вопросы, предложения или вы хотите
					отозвать согласие — вы можете связаться с нами:<br> Электронная почта: [ваш
					email] <br> Юр. адрес: [ваш юридический адрес (если есть)] <br> Телефон: [если
					есть]
                  </li>
					</ol>
					
				</div>
			</div>
		</div>
	</div>
</template>
<style scoped>
	.content {
		/* padding: 0 1em; */
		color: rgba(204, 204, 204, 0.5);
      line-height: 1.35;
	}
   .page-row {
      margin-bottom: 2em;
   }
   .content-head p{
      text-align: justify;
      margin-bottom: 1em;
   }

	ol {
		/* padding: 0 1em; */
		text-align: justify;
      list-style-position: inside;
	}
   li{
      margin-bottom: 1em;
   }
   
</style>
